const advantages = [
  {
    name: "Специализация на взрослых",
    description: (
      <span>
        Логопедия для взрослых имеет свои важные особенности, учет которых позволяет сделать наши
        занятия приятными и эффективными.
      </span>
    ),
  },
  {
    name: "Большой опыт",
    description: (
      <span>
        Более 4 лет я работаю со взрослыми. Основываясь на этом опыте, я смогу выстроить эффективный
        план для быстрейшего достижения положительного результата.
      </span>
    ),
  },
  {
    name: "Подтвержденные результаты",
    description: [
      <span key={0}>Мои ученики достигают реальных и ощутимых результатов и&nbsp;</span>,
      <a
        key={1}
        aria-label="делятся"
        href="#feedbacks"
      >
        делятся
      </a>,
      <span key={2}>&nbsp;своими положительными эмоциями.</span>,
    ],
  },
  {
    name: "Консультации и поддержка",
    description: (
      <span>
        Я всегда готова поддержать клиентов в процессе работы, отвечая на вопросы между занятиями,
        помогая с домашними заданиями и практическими рекомендациями.
      </span>
    ),
  },
];

export default advantages;
